<a href="https://colab.research.google.com/github/yooste/SOLUX_summer_data/blob/master/2%EC%A3%BC%EC%B0%A8/pandas_chap10_0730.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

school_id_list = [{'name':'John','job':'teacher','age':40},
                  {'name':'Nate','job':'teacher','age':35},
                  {'name':'Yuna','job':'teacher','age':37},
                  {'name':'Abraham','job':'student','age':10},
                  {'name':'Brian','job':'student','age':12},
                  {'name':'Jenny','job':'student','age':11},
                  {'name':'Nate','job':'teacher','age':None},
                  {'name':'John','job':'student','age':None}]
df = pd.DataFrame(school_id_list, columns = ['name','job','age'])

In [2]:
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Jenny  student  11.0
6     Nate  teacher   NaN
7     John  student   NaN

In [3]:
df.shape  # 8행 3열로 이루어진 데이터프레임

(8, 3)

In [4]:
df.info()   # non 값이 아닌 데이터 개수가 몇 개인지 알 수 있음

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    8 non-null      object
 1   job     8 non-null      object
 2   age     6 non-null      float64
dtypes: float64(1), object(2)
memory usage: 320.0+ bytes

In [5]:
df.isna() # None 값에 대하여 true/false로 알려줌. - True가 None임

    name    job    age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False   True
7  False  False   True

In [6]:
df.isnull()   # isna()와 같은 함수

    name    job    age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False   True
7  False  False   True

In [7]:
df.age = df.age.fillna(0)   # df.age에서 null 값을 발견하면 0으로 대체

In [9]:
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Jenny  student  11.0
6     Nate  teacher   0.0
7     John  student   0.0

In [10]:
school_id_list = [{'name':'John','job':'teacher','age':40},
                  {'name':'Nate','job':'teacher','age':35},
                  {'name':'Yuna','job':'teacher','age':37},
                  {'name':'Abraham','job':'student','age':10},
                  {'name':'Brian','job':'student','age':12},
                  {'name':'Jenny','job':'student','age':11},
                  {'name':'Nate','job':'teacher','age':None},
                  {'name':'John','job':'student','age':None}]
df = pd.DataFrame(school_id_list, columns = ['name','job','age'])

In [11]:
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Jenny  student  11.0
6     Nate  teacher   NaN
7     John  student   NaN

In [12]:
df['age'].fillna(df.groupby('job')['age'].transform('median'), inplace = True)
# age에서 null 값을 발견하면 job별로 age를 파악하여 그들의 중앙값으로 대체한다.

In [13]:
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Jenny  student  11.0
6     Nate  teacher  37.0
7     John  student  11.0